# Задание

* `Main01`
 
Сложность: легко (2/10)
```
Считать из консоли начальное значение и шаг арифметической прогрессии. 
Вывести первые 10 элементов прогрессии в консоль.
Здесь и дальше, если не написано инеча, выбор числового типа данных - на ваше усмотрение (int, long, float, double).
Пример 1:
    Ввод:
    4 
    2
    Вывод:
    4 6 8 10 12 14 16 18 20 22
Пример 2:
    Ввод:
    9 
    -2
    Вывод:
    9 7 5 3 1 -1 -3 -5 -7 -9
Подсказка:
Используйте System.out.print() вместо System.out.println() (без "ln" после слова print) чтобы выводить числа
не прыгая на следующую строку при каждом выводе
```

* `Main02`

Сложность: средне (4/10)
```
Считать из консоли начальное значение, шаг и количество элементов арифметической прогрессии. 
Записать прогрессию в массив, посчитать и вывести на экран сумму этих элементов прогрессии.

Важно: для решения этой задачи существует математическая формула, но в данном задании нужно использовать 
именно циклы и массивы.

Дополнительное задание: посчитать тоже самое по математической формуле (найти в интернете либо додуматься самостоятельно), 
сравнить результаты и вывести результат сравнения в консоль после основного результата

Пример 1 (без доп. задания):
    Ввод:
    1 
    3
    4 
    Вывод:
    Сумма = 22
Пример 2 (с доп. заданием):
    Ввод:
    10
    10
    10
    Вывод:
    Сумма через циклы = 550
    Сумма по формуле = 550
    Результат одинаковый = true
```

* `Main03`

Сложность: средне (5/10)
```
Написать программу, которая запрашивает у пользователя натуральное число. 
Если пользователь написал неподходящее число, программа спрашивает еще раз.
Таким образом, програма должна продолжать спрашивать, пока пользователь не введет подходящее число.

Напоминание: натуральные числа это те, которые используются при подсчете (т.е. целые позитивные, исключая ноль).

Дополнительное задание:
Вывести в консоль сколько попыток у пользователя заняло правильно ввести число.

Пример окончательного вывода одной программы:
    Введите натуральное число.
    -8
    Введите натуральное число.
    -11
    Введите натуральное число.
    0
    Введите натуральное число.
    4
    Вы ввели 4. Спасибо!
Пример окончательного вывода одной программы (с доп. заданием):
    Введите натуральное число.
    -1
    Введите натуральное число.
    -3
    Введите натуральное число.
    10
    Вы ввели 10. У вас получилось это сделать с 3 попытки. Спасибо!
```

* `Main04`

Сложность: сложно (6/10)
```
Создать в программе массив с 10 случайными значениями (взять из головы). Вывести массив на экран.
Попросить пользователя выбрать одно любое значение из массива (считать из консоли значение элемента).
Вывести в консоль индекс первого элемента, значение которого равно выбранному пользователем значению. Если в массиве нет такого элемента, 
вывести соответствующее сообщение

Дополнительное задание 1:
Генерировать случайные числа с помощью генератора случайных чисел вместо того чтобы их придумывать самостоятельно

Дополнительное задание 2:
Вынести код который находит индекс значения в отдельный метод

Пример 1:
    Вывод:
    4 8 9 11 2 -6 44 5 15 32
    Введите значение любого элемента.
    Ввод:
    11
    Вывод:
    Индекс элемента с этим значением = 3
Пример 2:
    Вывод:
    4 8 9 11 2 -6 44 5 15 32
    Введите значение любого элемента.
    Ввод:
    500
    Вывод:
    В этом массиве нет такого элемента
```

* `Main05` (Дополнительное задание)

Сложность: сложно (9/10)

```
"Пирамидка"

Запросить у пользователя цифру от 1 до 9.
Для этого можно считывать тип char, либо использовать модифицированный код из задания Main03.
Вывести "пирамидку" из цифр (см. примеры), где вершиной будет цифра, введенная пользователем

Примеры:
Вариант 1:
    Ввод:
    6
    Вывод:
    1
    12
    123
    1234
    12345
    123456
    12345
    1234
    123
    12
    1
Вариант 2:
    Ввод:
    5
    Вывод:
    1
    22
    333
    4444
    55555
    4444
    333
    22
    1
```
